Repository: pdv-software/device
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de_de

source: Device API
de_de: Geräte API

source: Apikey authentication
de_de: Apikey Authentisierung

source: If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:
de_de: Wenn Sie die folgenden Aktionen ohne vorherige Anmeldung ausführen, muss der API Key hinzugefügt werden:

source: Append on the URL of your request: &apikey=APIKEY
de_de: Der URL hinzufügen: &apikey=APIKEY

source: Use POST parameter: "apikey=APIKEY"
de_de: POST Parameter: "apikey=APIKEY"

source: Add the HTTP header: "Authorization: Bearer APIKEY"
de_de: HTTP Header: "Authorization: Bearer APIKEY"

source: Read only:
de_de: Lesen:

source: Read & Write:
de_de: Lesen und Schreiben

source: Devicekey authentication
de_de: Device-Key Authorisierung

source: Using a device key will only allow sending data for the Node of that device, giving a greater level of security.
de_de: Das Benutzen eines Device-Key erlaubt das Senden von Daten nur für dieses eine Gerät und verschafft eine höhere Sicherheit beim Zugriff.

source: The input module can use a devicekey instead of an apikey. If you want to authenticate as a device, just replace apikey=APIKEY with devicekey=DEVICEKEY:
de_de: Das Input Modul kann spezielle Device-Key statt eines allgemeinen Api-Key verwenden. Um einzelne Geräte zu authentizieren muss apikey=APIKEY mit devicekey=DEVICEKEY ersetzt werden.

source: Append on the input URL of your request: &devicekey=DEVICEKEY
de_de: Beim Request der Input URL hinzufügen: &devicekey=DEVICEKEY

source: Use POST parameter while calling input: "devicekey=DEVICEKEY"
de_de: POST Parameter beim Aufruf eines Input: "devicekey=DEVICEKEY"

source: Ensure that the sent input Node matches the Node that is configured for the device on the device menu.
de_de: Stellen Sie beim Versenden von Input-Daten sicher, dass ein Node angegeben ist. Der Node wird in der Geräteliste konfiguriert.

source: Available HTML URLs
de_de: Verfügbare HTML URLs

source: The device list view
de_de: Geräteansicht

source: This page
de_de: Geräte API (aktuelle Seite)

source: Available JSON commands
de_de: JSON Befehle

source: To use the json api the request url needs to include <b>.json</b>
de_de: Bei der Benutzung der json API muss der URL <b>.json</b> hinzugefügt werden.

source: Device actions
de_de: Gerät Aktionen

source: List devices
de_de: Geräte Anzeigen

source: Get device details
de_de: Gerät Details

source: Add a device
de_de: Gerät Hinzufügen

source: Delete device
de_de: Gerät Löschen

source: Update device
de_de: Gerät Aktualisieren

source: List templates
de_de: Vorlagenliste

source: Initialize device
de_de: Geräte Initialisierung

source: Devices templates documentation
de_de: Dokumentation Geräte-Vorlagen

source: Template files are located at <b>'\Modules\device\data\*.json'</b>
de_de: Vorlagen Dateien werden abgelegt unter <b>'\Modules\device\data\*.json'</b>

source: Each file defines a device type and provides the default inputs and feeds configurations for that device.
de_de: Jede Vorlage definiert einen Gerätetyp und stellt die Default-Konfiguration für Inputs und Feeds für ein Gerät.

source: A device should only need to be initialized once on instalation. Initiating a device twice will duplicate its default inputs and feeds.
de_de: Ein Gerätetyp bei der Installation muss nur einmal initialisiert werden. Jede weitere Initalisierung erstellt weitere Inputs und Feeds als Kopie.

source: Devices Help
de_de: Geräte Hilfe

source: Devices
de_de: Geräte

source: loading...
de_de: wird geladen ...

source: No devices
de_de: Keine Geräte

source: There are no devices configured. Please add a new device.
de_de: Es sind keine Geräte konfiguriert, Bitte erstellen Sie ein neues Gerät.

source: New device
de_de: Neues Gerät

source: Deleting a device is permanent.
de_de: Das Löschen eines Gerätes ist endgültig!

source: If this device is active and is using a device key, it will no longer be able to post data.
de_de: Warnung: Sollte das Gerät aktiv sein und per <b>Device-Key</b> Daten senden, wird dies nicht mehr funktionieren.

source: Inputs and Feeds that this device uses are not deleted and all historic data is kept. To remove them, deleted manualy afterwards.
de_de: Inputs und Feeds die dieses Gerät bereitstellt werden nicht gelöscht. Die aufgezeichneten Daten bleiben erhalten.<br>Zum Löschen der Daten müssen die Feeds anschließend manuell gelöscht werden.

source: Are you sure you want to delete?
de_de: Wirklich löschen?

source: Cancel
de_de: Abbruch

source: Delete permanently
de_de: Dauerhaft löschen

source: Default inputs and associated feeds will be automaticaly created.
de_de: Es werden jetzt die Default Inputs und Feeds automatisch erstellt.

source: Make sure the selected device node and type are correcly configured before proceding.
de_de: Stellen Sie sicher das Gerätetyp und -Node richtig konfiguriert sind, bevor Sie die fortfahren.

source: Initializing a device usualy should only be done once on installation.
de_de: Die Initalisierung eines Gerätes sollte nur einmalig bei der Installation erfolgen.

source: If the node name already exists, new default inputs and feeds will be added.
de_de: Wenn der Node bereits existiert werden die Inputs und Feed hinzugefügt.

source: Initialize
de_de: Initialisieren

source: Location
de_de: Standort

source: Type
de_de: Typ

source: Device access key
de_de: Device-Key

source: Updated
de_de: Geändert

source: Edit
de_de: Bearbeiten

source: Delete
de_de: Löschen

source: Device Setup
de_de: Geräte
